<template>
  <div class="chat__rigth">
    <div class="chat__right-top">
      <div class="chat__member-right">
        <button class="chat__btn-back">
          <svg xmlns="http://www.w3.org/2000/svg" width="31" height="31"
               viewBox="0 0 31 31">
            <g transform="translate(-355 -7482)">
              <g transform="translate(355 7482)" fill="none">
                <path d="M15.5,0A15.5,15.5,0,1,1,0,15.5,15.5,15.5,0,0,1,15.5,0Z"
                      stroke="none"/>
                <path class="cirlce"
                      d="M 15.5 1 C 11.62690925598145 1 7.985639572143555 2.508260726928711 5.246950149536133 5.246950149536133 C 2.508260726928711 7.985639572143555 1 11.62690925598145 1 15.5 C 1 19.37308883666992 2.508260726928711 23.01436042785645 5.246950149536133 25.75304985046387 C 7.985639572143555 28.49173927307129 11.62690925598145 30 15.5 30 C 19.37308883666992 30 23.01436042785645 28.49173927307129 25.75304985046387 25.75304985046387 C 28.49173927307129 23.01436042785645 30 19.37308883666992 30 15.5 C 30 11.62690925598145 28.49173927307129 7.985639572143555 25.75304985046387 5.246950149536133 C 23.01436042785645 2.508260726928711 19.37308883666992 1 15.5 1 M 15.5 0 C 24.06040954589844 0 31 6.939590454101562 31 15.5 C 31 24.06040954589844 24.06040954589844 31 15.5 31 C 6.939590454101562 31 0 24.06040954589844 0 15.5 C 0 6.939590454101562 6.939590454101562 0 15.5 0 Z"
                      stroke="none" fill="inherit"/>
              </g>
              <g transform="translate(62.479 6936.353) rotate(45)">
                <path d="M0,0V8.612" transform="translate(612.13 173.001)"
                      fill="none" stroke="inherit" stroke-linecap="round"
                      stroke-width="1"/>
                <path d="M0,0H8.615" transform="translate(612.13 181.616)"
                      fill="none" stroke="inherit" stroke-linecap="round"
                      stroke-width="1"/>
              </g>
            </g>
          </svg>

        </button>
        <div class="chat__avatar">НН</div>
        <div class="chat__name _no-active">
          <p class="chat__user-name">Надежда Николаевна</p>
          <span>в сети</span>
        </div>

      </div>

    </div>
    <div class="chat__email" ref="chat">
      <ul class="chat__list">
        <li class="chat__item _date">21 августа</li>
        <li class="chat__item">
          <div class="chat__inner">
            <div class="chat__item-wrap">
              <div class="chat__avatar">ЕЕ</div>
              <div class="chat__name _no-active">
                <p class="chat__user-name">Евгений Евгеньевич</p>
              </div>
            </div>
            <div class="chat__wrap-time">
              <div class="chat__checkbox">
                <svg xmlns="http://www.w3.org/2000/svg" width="20.225"
                     height="11.406" viewBox="0 0 20.225 11.406">
                  <path
                    d="M11.507,15.42a.677.677,0,0,1,0-.957l5.305-5.3a.677.677,0,0,1,.957.957l-5.3,5.3a.677.677,0,0,1-.958,0ZM22.455,9.4a.677.677,0,0,0-.957,0l-9.05,9.349L8.334,14.623a.677.677,0,1,0-.958.957l1.5,1.515L7.223,18.747,3.588,15.239a.679.679,0,0,0-.961.961l4.114,3.988a.677.677,0,0,0,.958,0l2.13-2.131,2.13,2.131a.677.677,0,0,0,.958,0l9.537-9.832a.677.677,0,0,0,0-.957Z"
                    transform="translate(-2.428 -8.981)" fill="inherit"/>
                </svg>
              </div>
              <time class="chat__time">18:24</time>
            </div>
          </div>
          <div class="chat__message">
            <div class="chat__file">
              <div class="chat__file-img">
                <img src="@/static/img/portfolio/pf-snt/chat/kos.jpg" alt="">
                <img src="@/static/img/portfolio/pf-snt/chat/kos.jpg" alt="">
              </div>
            </div>
            <div class="chat__text">Раздел «Техподдержка» аналогичен по своей
              структуре - будет содержать левую панель с обращениями и диалоговое
              окно.
            </div>

          </div>
        </li>
        <li class="chat__item _date">22 августа</li>
        <li class="chat__item">
          <div class="chat__inner">
            <div class="chat__item-wrap">
              <div class="chat__avatar">НН</div>
              <div class="chat__name _no-active">
                <p class="chat__user-name">Надежда Николаевна</p>
              </div>
            </div>
            <div class="chat__wrap-time">
              <div class="chat__checkbox">
                <svg xmlns="http://www.w3.org/2000/svg" width="20.225"
                     height="11.406" viewBox="0 0 20.225 11.406">
                  <path
                    d="M11.507,15.42a.677.677,0,0,1,0-.957l5.305-5.3a.677.677,0,0,1,.957.957l-5.3,5.3a.677.677,0,0,1-.958,0ZM22.455,9.4a.677.677,0,0,0-.957,0l-9.05,9.349L8.334,14.623a.677.677,0,1,0-.958.957l1.5,1.515L7.223,18.747,3.588,15.239a.679.679,0,0,0-.961.961l4.114,3.988a.677.677,0,0,0,.958,0l2.13-2.131,2.13,2.131a.677.677,0,0,0,.958,0l9.537-9.832a.677.677,0,0,0,0-.957Z"
                    transform="translate(-2.428 -8.981)" fill="inherit"/>
                </svg>
              </div>
              <time class="chat__time">20:30</time>
            </div>
          </div>
          <div class="chat__message">
            <div class="chat__file">
              <div class="chat__link">
                <div class="chat__wrap-svg">
                  <svg xmlns="http://www.w3.org/2000/svg" width="12.411"
                       height="16" viewBox="0 0 12.411 16">
                    <g transform="translate(0)">
                      <path
                        d="M7.671-68.154H15.7a2.215,2.215,0,0,0,1.644-.556,2.26,2.26,0,0,0,.548-1.652V-77.4a4.424,4.424,0,0,0-.045-.691,1.487,1.487,0,0,0-.176-.507,2.55,2.55,0,0,0-.387-.492l-4.407-4.452a2.231,2.231,0,0,0-.466-.379,1.506,1.506,0,0,0-.5-.18,3.638,3.638,0,0,0-.638-.049h-3.6a2.21,2.21,0,0,0-1.637.559,2.255,2.255,0,0,0-.556,1.656v11.578A2.251,2.251,0,0,0,6.03-68.71a2.217,2.217,0,0,0,1.641.556Zm.045-.931a1.324,1.324,0,0,1-.976-.33,1.313,1.313,0,0,1-.33-.969V-81.917a1.331,1.331,0,0,1,.33-.965,1.3,1.3,0,0,1,.976-.342h3.521v4.52a1.283,1.283,0,0,0,.315.95,1.294,1.294,0,0,0,.946.312h4.467v7.058a1.313,1.313,0,0,1-.33.969,1.335,1.335,0,0,1-.984.33ZM12.6-78.32a.5.5,0,0,1-.372-.113.53.53,0,0,1-.109-.375v-4.227l4.663,4.715Z"
                        transform="translate(-5.479 84.154)"
                        fill="#319adc"/>
                      <path
                        d="M.229-.279A.327.327,0,0,1,.316-.527.356.356,0,0,1,.572-.611a.346.346,0,0,1,.251.086.327.327,0,0,1,.089.246.327.327,0,0,1-.09.243.34.34,0,0,1-.25.089A.35.35,0,0,1,.318-.034.325.325,0,0,1,.229-.279ZM2.145.039a.709.709,0,0,1-.6-.3,1.374,1.374,0,0,1-.22-.828,1.375,1.375,0,0,1,.224-.837.726.726,0,0,1,.616-.3.712.712,0,0,1,.629.32h.02a2.435,2.435,0,0,1-.045-.436v-.7h.6V0H2.9L2.789-.283H2.764A.682.682,0,0,1,2.145.039Zm.209-.475a.4.4,0,0,0,.335-.133A.773.773,0,0,0,2.8-1.02v-.064a.893.893,0,0,0-.108-.5.4.4,0,0,0-.353-.152.35.35,0,0,0-.31.169.9.9,0,0,0-.11.491A.854.854,0,0,0,2.035-.6.364.364,0,0,0,2.354-.436ZM4.459-1.1a.916.916,0,0,0,.106.49.381.381,0,0,0,.347.166A.375.375,0,0,0,5.255-.6a.93.93,0,0,0,.1-.491.9.9,0,0,0-.105-.486.381.381,0,0,0-.346-.162.38.38,0,0,0-.344.161A.9.9,0,0,0,4.459-1.1Zm1.51,0a1.173,1.173,0,0,1-.281.834,1.02,1.02,0,0,1-.783.3A1.1,1.1,0,0,1,4.35-.1a.916.916,0,0,1-.369-.4,1.329,1.329,0,0,1-.129-.6,1.167,1.167,0,0,1,.279-.832,1.026,1.026,0,0,1,.785-.3,1.1,1.1,0,0,1,.555.137A.913.913,0,0,1,5.84-1.7,1.317,1.317,0,0,1,5.969-1.1ZM7.348.039q-1.02,0-1.02-1.119a1.194,1.194,0,0,1,.277-.851A1.04,1.04,0,0,1,7.4-2.225a1.515,1.515,0,0,1,.68.148L7.9-1.615q-.141-.057-.262-.093A.843.843,0,0,0,7.4-1.744q-.465,0-.465.66,0,.641.465.641a1.06,1.06,0,0,0,.318-.046,1.149,1.149,0,0,0,.293-.144v.51A.96.96,0,0,1,7.72,0,1.642,1.642,0,0,1,7.348.039Z"
                        transform="translate(2 12)" fill="#319adc"/>
                    </g>
                  </svg>
                </div>

                <span  class="link">Реестр_правил.doc</span>
              </div>
            </div>
            <div class="chat__text">Ознакомьтесь, пожалуйста, с основными правилами.
              Это облегчит взаимодействие председателя с дачниками и упростить
              работу с другими обязательными документами.
            </div>

          </div>
        </li>

        <li class="chat__item">
          <div class="chat__inner">
            <div class="chat__item-wrap">
              <div class="chat__avatar">ЕЕ</div>
              <div class="chat__name _no-active">
                <p class="chat__user-name">Евгений Евгеньевич</p>
              </div>
            </div>
            <div class="chat__wrap-time">
              <div class="chat__checkbox">
                <svg xmlns="http://www.w3.org/2000/svg" width="20.225"
                     height="11.406" viewBox="0 0 20.225 11.406">
                  <path
                    d="M11.507,15.42a.677.677,0,0,1,0-.957l5.305-5.3a.677.677,0,0,1,.957.957l-5.3,5.3a.677.677,0,0,1-.958,0ZM22.455,9.4a.677.677,0,0,0-.957,0l-9.05,9.349L8.334,14.623a.677.677,0,1,0-.958.957l1.5,1.515L7.223,18.747,3.588,15.239a.679.679,0,0,0-.961.961l4.114,3.988a.677.677,0,0,0,.958,0l2.13-2.131,2.13,2.131a.677.677,0,0,0,.958,0l9.537-9.832a.677.677,0,0,0,0-.957Z"
                    transform="translate(-2.428 -8.981)" fill="inherit"/>
                </svg>
              </div>
              <time class="chat__time">20:30</time>
            </div>
          </div>
          <div class="chat__message">

            <div class="chat__text"><span class="link">@NadezhdaNikolaevna</span> спасибо.
            </div>

          </div>
        </li>

        <li class="chat__item _date">23 августа</li>
        <li v-if="messages.length === 0" class="chat__item _new">
          <div class="_new-message">Не прочитанные сообщения</div>
        </li>
        <li class="chat__item">
          <div class="chat__inner">
            <div class="chat__item-wrap">
              <div class="chat__avatar">НН</div>
              <div class="chat__name _no-active">
                <p class="chat__user-name">Надежда Николаевна</p>
              </div>
            </div>
            <div class="chat__wrap-time">
              <div class="chat__checkbox">
                <svg v-if="messages.length === 0" class="_unread" xmlns="http://www.w3.org/2000/svg"
                     width="15.475" height="11.187" viewBox="0 0 15.475 11.187">
                  <path
                    d="M22.455,9.4a.677.677,0,0,0-.957,0l-9.05,9.349L8.334,14.623a.677.677,0,1,0-.958.957l1.5,1.515.955.961,2.13,2.131a.677.677,0,0,0,.958,0l9.537-9.832a.677.677,0,0,0,0-.957Z"
                    transform="translate(-7.178 -9.2)" fill="inherit"/>
                </svg>
                <svg v-else xmlns="http://www.w3.org/2000/svg" width="20.225"
                     height="11.406" viewBox="0 0 20.225 11.406">
                  <path
                    d="M11.507,15.42a.677.677,0,0,1,0-.957l5.305-5.3a.677.677,0,0,1,.957.957l-5.3,5.3a.677.677,0,0,1-.958,0ZM22.455,9.4a.677.677,0,0,0-.957,0l-9.05,9.349L8.334,14.623a.677.677,0,1,0-.958.957l1.5,1.515L7.223,18.747,3.588,15.239a.679.679,0,0,0-.961.961l4.114,3.988a.677.677,0,0,0,.958,0l2.13-2.131,2.13,2.131a.677.677,0,0,0,.958,0l9.537-9.832a.677.677,0,0,0,0-.957Z"
                    transform="translate(-2.428 -8.981)" fill="inherit"/>
                </svg>
              </div>
              <time class="chat__time">15:23</time>
            </div>
          </div>
          <div class="chat__message">
            <div class="chat__file">
              <div class="chat__link">
                <div class="chat__wrap-svg">
                  <svg xmlns="http://www.w3.org/2000/svg" width="12.411"
                       height="16" viewBox="0 0 12.411 16">
                    <g transform="translate(0)">
                      <path
                        d="M7.671-68.154H15.7a2.215,2.215,0,0,0,1.644-.556,2.26,2.26,0,0,0,.548-1.652V-77.4a4.424,4.424,0,0,0-.045-.691,1.487,1.487,0,0,0-.176-.507,2.55,2.55,0,0,0-.387-.492l-4.407-4.452a2.231,2.231,0,0,0-.466-.379,1.506,1.506,0,0,0-.5-.18,3.638,3.638,0,0,0-.638-.049h-3.6a2.21,2.21,0,0,0-1.637.559,2.255,2.255,0,0,0-.556,1.656v11.578A2.251,2.251,0,0,0,6.03-68.71a2.217,2.217,0,0,0,1.641.556Zm.045-.931a1.324,1.324,0,0,1-.976-.33,1.313,1.313,0,0,1-.33-.969V-81.917a1.331,1.331,0,0,1,.33-.965,1.3,1.3,0,0,1,.976-.342h3.521v4.52a1.283,1.283,0,0,0,.315.95,1.294,1.294,0,0,0,.946.312h4.467v7.058a1.313,1.313,0,0,1-.33.969,1.335,1.335,0,0,1-.984.33ZM12.6-78.32a.5.5,0,0,1-.372-.113.53.53,0,0,1-.109-.375v-4.227l4.663,4.715Z"
                        transform="translate(-5.479 84.154)"
                        fill="#319adc"/>
                      <path
                        d="M.229-.279A.327.327,0,0,1,.316-.527.356.356,0,0,1,.572-.611a.346.346,0,0,1,.251.086.327.327,0,0,1,.089.246.327.327,0,0,1-.09.243.34.34,0,0,1-.25.089A.35.35,0,0,1,.318-.034.325.325,0,0,1,.229-.279ZM2.145.039a.709.709,0,0,1-.6-.3,1.374,1.374,0,0,1-.22-.828,1.375,1.375,0,0,1,.224-.837.726.726,0,0,1,.616-.3.712.712,0,0,1,.629.32h.02a2.435,2.435,0,0,1-.045-.436v-.7h.6V0H2.9L2.789-.283H2.764A.682.682,0,0,1,2.145.039Zm.209-.475a.4.4,0,0,0,.335-.133A.773.773,0,0,0,2.8-1.02v-.064a.893.893,0,0,0-.108-.5.4.4,0,0,0-.353-.152.35.35,0,0,0-.31.169.9.9,0,0,0-.11.491A.854.854,0,0,0,2.035-.6.364.364,0,0,0,2.354-.436ZM4.459-1.1a.916.916,0,0,0,.106.49.381.381,0,0,0,.347.166A.375.375,0,0,0,5.255-.6a.93.93,0,0,0,.1-.491.9.9,0,0,0-.105-.486.381.381,0,0,0-.346-.162.38.38,0,0,0-.344.161A.9.9,0,0,0,4.459-1.1Zm1.51,0a1.173,1.173,0,0,1-.281.834,1.02,1.02,0,0,1-.783.3A1.1,1.1,0,0,1,4.35-.1a.916.916,0,0,1-.369-.4,1.329,1.329,0,0,1-.129-.6,1.167,1.167,0,0,1,.279-.832,1.026,1.026,0,0,1,.785-.3,1.1,1.1,0,0,1,.555.137A.913.913,0,0,1,5.84-1.7,1.317,1.317,0,0,1,5.969-1.1ZM7.348.039q-1.02,0-1.02-1.119a1.194,1.194,0,0,1,.277-.851A1.04,1.04,0,0,1,7.4-2.225a1.515,1.515,0,0,1,.68.148L7.9-1.615q-.141-.057-.262-.093A.843.843,0,0,0,7.4-1.744q-.465,0-.465.66,0,.641.465.641a1.06,1.06,0,0,0,.318-.046,1.149,1.149,0,0,0,.293-.144v.51A.96.96,0,0,1,7.72,0,1.642,1.642,0,0,1,7.348.039Z"
                        transform="translate(2 12)" fill="#319adc"/>
                    </g>
                  </svg>
                </div>

                <span class="link">Реестр_правил (ч.2).doc</span>
              </div>
              <div class="chat__link">
                <div class="chat__wrap-svg">
                  <svg xmlns="http://www.w3.org/2000/svg" width="12.411"
                       height="16" viewBox="0 0 12.411 16">
                    <g transform="translate(0)">
                      <path
                        d="M7.671-68.154H15.7a2.215,2.215,0,0,0,1.644-.556,2.26,2.26,0,0,0,.548-1.652V-77.4a4.424,4.424,0,0,0-.045-.691,1.487,1.487,0,0,0-.176-.507,2.55,2.55,0,0,0-.387-.492l-4.407-4.452a2.231,2.231,0,0,0-.466-.379,1.506,1.506,0,0,0-.5-.18,3.638,3.638,0,0,0-.638-.049h-3.6a2.21,2.21,0,0,0-1.637.559,2.255,2.255,0,0,0-.556,1.656v11.578A2.251,2.251,0,0,0,6.03-68.71a2.217,2.217,0,0,0,1.641.556Zm.045-.931a1.324,1.324,0,0,1-.976-.33,1.313,1.313,0,0,1-.33-.969V-81.917a1.331,1.331,0,0,1,.33-.965,1.3,1.3,0,0,1,.976-.342h3.521v4.52a1.283,1.283,0,0,0,.315.95,1.294,1.294,0,0,0,.946.312h4.467v7.058a1.313,1.313,0,0,1-.33.969,1.335,1.335,0,0,1-.984.33ZM12.6-78.32a.5.5,0,0,1-.372-.113.53.53,0,0,1-.109-.375v-4.227l4.663,4.715Z"
                        transform="translate(-5.479 84.154)"
                        fill="#319adc"/>
                      <path
                        d="M.229-.279A.327.327,0,0,1,.316-.527.356.356,0,0,1,.572-.611a.346.346,0,0,1,.251.086.327.327,0,0,1,.089.246.327.327,0,0,1-.09.243.34.34,0,0,1-.25.089A.35.35,0,0,1,.318-.034.325.325,0,0,1,.229-.279ZM2.145.039a.709.709,0,0,1-.6-.3,1.374,1.374,0,0,1-.22-.828,1.375,1.375,0,0,1,.224-.837.726.726,0,0,1,.616-.3.712.712,0,0,1,.629.32h.02a2.435,2.435,0,0,1-.045-.436v-.7h.6V0H2.9L2.789-.283H2.764A.682.682,0,0,1,2.145.039Zm.209-.475a.4.4,0,0,0,.335-.133A.773.773,0,0,0,2.8-1.02v-.064a.893.893,0,0,0-.108-.5.4.4,0,0,0-.353-.152.35.35,0,0,0-.31.169.9.9,0,0,0-.11.491A.854.854,0,0,0,2.035-.6.364.364,0,0,0,2.354-.436ZM4.459-1.1a.916.916,0,0,0,.106.49.381.381,0,0,0,.347.166A.375.375,0,0,0,5.255-.6a.93.93,0,0,0,.1-.491.9.9,0,0,0-.105-.486.381.381,0,0,0-.346-.162.38.38,0,0,0-.344.161A.9.9,0,0,0,4.459-1.1Zm1.51,0a1.173,1.173,0,0,1-.281.834,1.02,1.02,0,0,1-.783.3A1.1,1.1,0,0,1,4.35-.1a.916.916,0,0,1-.369-.4,1.329,1.329,0,0,1-.129-.6,1.167,1.167,0,0,1,.279-.832,1.026,1.026,0,0,1,.785-.3,1.1,1.1,0,0,1,.555.137A.913.913,0,0,1,5.84-1.7,1.317,1.317,0,0,1,5.969-1.1ZM7.348.039q-1.02,0-1.02-1.119a1.194,1.194,0,0,1,.277-.851A1.04,1.04,0,0,1,7.4-2.225a1.515,1.515,0,0,1,.68.148L7.9-1.615q-.141-.057-.262-.093A.843.843,0,0,0,7.4-1.744q-.465,0-.465.66,0,.641.465.641a1.06,1.06,0,0,0,.318-.046,1.149,1.149,0,0,0,.293-.144v.51A.96.96,0,0,1,7.72,0,1.642,1.642,0,0,1,7.348.039Z"
                        transform="translate(2 12)" fill="#319adc"/>
                    </g>
                  </svg>
                </div>

                <span class="link">Устав Товарищества в соответствие 217-ФЗ.doc</span>
              </div>
            </div>
            <div class="chat__text">Ещё несколько документов для ознакомления</div>
          </div>
        </li>
        <li v-for="message in messages" :key="message.id" class="chat__item">
          <div class="chat__inner">
            <div class="chat__item-wrap">
              <div class="chat__avatar">ЕЕ</div>
              <div class="chat__name _no-active">
                <p class="chat__user-name">Евгений Евгеньевич</p>
              </div>
            </div>
            <div class="chat__wrap-time">
              <div class="chat__checkbox">
                <svg class="_unread" xmlns="http://www.w3.org/2000/svg"
                     width="15.475" height="11.187" viewBox="0 0 15.475 11.187">
                  <path
                    d="M22.455,9.4a.677.677,0,0,0-.957,0l-9.05,9.349L8.334,14.623a.677.677,0,1,0-.958.957l1.5,1.515.955.961,2.13,2.131a.677.677,0,0,0,.958,0l9.537-9.832a.677.677,0,0,0,0-.957Z"
                    transform="translate(-7.178 -9.2)" fill="inherit"/>
                </svg>
              </div>
              <time class="chat__time">{{message.time}}</time>
            </div>
          </div>
          <div class="chat__message">
            <template v-if="message.file">
              <div v-if="message.fileSrc" class="chat__file-img">
                <img :src="message.fileSrc">
              </div>
              <div  v-else class="chat__file">
                <div class="chat__link">
                  <div class="chat__wrap-svg">
                    <svg xmlns="http://www.w3.org/2000/svg" width="12.411"
                         height="16" viewBox="0 0 12.411 16">
                      <g transform="translate(0)">
                        <path
                          d="M7.671-68.154H15.7a2.215,2.215,0,0,0,1.644-.556,2.26,2.26,0,0,0,.548-1.652V-77.4a4.424,4.424,0,0,0-.045-.691,1.487,1.487,0,0,0-.176-.507,2.55,2.55,0,0,0-.387-.492l-4.407-4.452a2.231,2.231,0,0,0-.466-.379,1.506,1.506,0,0,0-.5-.18,3.638,3.638,0,0,0-.638-.049h-3.6a2.21,2.21,0,0,0-1.637.559,2.255,2.255,0,0,0-.556,1.656v11.578A2.251,2.251,0,0,0,6.03-68.71a2.217,2.217,0,0,0,1.641.556Zm.045-.931a1.324,1.324,0,0,1-.976-.33,1.313,1.313,0,0,1-.33-.969V-81.917a1.331,1.331,0,0,1,.33-.965,1.3,1.3,0,0,1,.976-.342h3.521v4.52a1.283,1.283,0,0,0,.315.95,1.294,1.294,0,0,0,.946.312h4.467v7.058a1.313,1.313,0,0,1-.33.969,1.335,1.335,0,0,1-.984.33ZM12.6-78.32a.5.5,0,0,1-.372-.113.53.53,0,0,1-.109-.375v-4.227l4.663,4.715Z"
                          transform="translate(-5.479 84.154)"
                          fill="#319adc"/>
                      </g>
                    </svg>
                  </div>

                  <span class="link">{{message.file.name}}</span>
                </div>
              </div>
            </template>
            <div class="chat__text" v-if="message.message">{{message.message}}</div>

          </div>
        </li>
      </ul>
    </div>
    <div class="chat__right-bottom">
      <form class="chat__form" @submit.prevent.stop="sendMessage">
        <label>
          <input type="file" class="chat__input-file" hidden @change="uploadFile">
          <span class="chat__input-file-btn" :style="`background-image: url(${imageInput});`"></span>
        </label>
        <textarea
          v-model="messageUser"
          class="chat__textarea"
          placeholder="Ваше сообщение…"
        ></textarea>
        <button type="submit" class="chat__form-btn">
          <span>Отправить</span>
          <svg xmlns="http://www.w3.org/2000/svg" width="22.916" height="22.916"
               viewBox="0 0 22.916 22.916">
            <path
              d="M18.047,2.225l0,0c-.006-.014-.012-.027-.018-.04h0A.382.382,0,0,0,18,2.141l0-.006a.246.246,0,0,0-.022-.029L17.97,2.1c-.01-.011-.019-.022-.03-.033s-.022-.021-.034-.03l-.006,0A.313.313,0,0,0,17.867,2l0,0a.477.477,0,0,0-.443-.044L2.681,7.886a1.282,1.282,0,0,0-.051,2.357l4.906,2.225,2.225,4.906a1.264,1.264,0,0,0,1.166.752h.03a1.262,1.262,0,0,0,1.161-.8l5.93-14.74a.365.365,0,0,0,.014-.042v0a.426.426,0,0,0,.01-.043h0A.478.478,0,0,0,18.047,2.225ZM3.027,9.366A.318.318,0,0,1,3.04,8.78L15.6,3.73l-7.8,7.8Zm8.2,7.6a.308.308,0,0,1-.289.2.317.317,0,0,1-.3-.187L8.474,12.21l7.8-7.8Z"
              transform="translate(11.49 -2.687) rotate(45)" fill="#fff"/>
          </svg>

        </button>
      </form>
    </div>
  </div>
</template>

<script>

/* ** messages[]
* {
*  id: Number
*  file: Number
*  message: String
* }
 */
import {format} from "date-fns";
import imageInput from "@/static/img/portfolio/pf-snt/chat/icon-input.svg";

export default {
  name: "ChatElement",
  data() {
    return {
      imageInput,
      fileInput: null,
      messageUser: null,
      fileData: null,
      messages: [],
      timerScroll: null
    }
  },
  watch: {
    messages() {
      const chat = this.$refs.chat;
      if (chat) {
        clearTimeout(this.timerScroll);
        this.timerScroll = setTimeout(() => {
          chat.scrollTop = chat.scrollHeight + 100;
        }, 100);
      }
    }
  },
  methods: {
    uploadFile(e) {
      if (!e){
        return;
      }

      const files = e.target.files;
      if (!files  || files.length === 0) {
        this.fileInput = null;
        return;
      }

      this.fileInput = files[0];
    },
    async sendMessage() {

      if (!this.messageUser && !this.fileInput) {
        return false;
      }

      const obj =  {
        type: 'message',
        id: this.messages.length + 1,
        file: this.fileInput || null,
        fileSrc: null,
        message: this.messageUser,
        time: format(new Date(), 'HH:mm'),
      };

      if (this.fileInput?.type && this.fileInput.type.includes("image")) {
        const fileReader = new FileReader();
        fileReader.onload = e => {
          if (!e) {
            return;
          }
          obj.fileSrc = e.target.result;
        }
        await fileReader.readAsDataURL(this.fileInput);
      }

      this.messages  = [...this.messages, obj];

      this.messageUser = null;
      this.fileInput = null;

      return false;
    }
  }
}
</script>

<style scoped>

</style>
